### Import Libraries

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import statsmodels.api as sm
import datetime

%matplotlib inline
sns.set_style('dark')
sns.set(font_scale=1.2)

import warnings
warnings.filterwarnings('ignore')

import feature_engine.missing_data_imputers as mdi
from feature_engine import outlier_removers as outr

pd.set_option('display.max_columns',None)
#pd.set_option('display.max_rows',None)
pd.set_option('display.width', 1000)

np.random.seed(0)
np.set_printoptions(suppress=True)

In [2]:
demo_df = pd.read_csv("custdemo.csv",parse_dates=['DOB'])

In [3]:
demo_df

      customer_id      first_name  last_name  gender  past_3_years_bike_related_purchases        DOB               job_title job_industry_category     wealth_segment deceased_indicator                                            default owns_car  tenure
0               1         Laraine  Medendorp       F                                   93 1953-12-10     Executive Secretary                Health      Mass Customer                  N                                                 "'      Yes    11.0
1               2             Eli    Bockman    Male                                   81 1980-12-16  Administrative Officer    Financial Services      Mass Customer                  N                       <script>alert('hi')</script>      Yes    16.0
2               3           Arlin     Dearle    Male                                   61 1954-01-20      Recruiting Manager              Property      Mass Customer                  N                                              1-Feb      Yes    15.0
3               4          Talbot        NaN    Male                                   33 1961-03-10                     NaN                    IT      Mass Customer                  N  () { _; } >_[$($())] { touch /tmp/blns.shellsh...       No     7.0
4               5  Sheila-kathryn     Calton  Female                                   56 1977-05-13           Senior Editor                   NaN  Affluent Customer                  N                                                NIL      Yes     8.0
...           ...             ...        ...     ...                                  ...        ...                     ...                   ...                ...                ...                                                ...      ...     ...
3995         3996         Rosalia   Halgarth  Female                                    8 1975-09-08   VP Product Management                Health      Mass Customer                  N                                          -1.00E+02       No    19.0
3996         3997          Blanch     Nisuis  Female                                   87 2001-07-13         Statistician II         Manufacturing     High Net Worth                  N                                           â¦testâ§      Yes     1.0
3997         3998          Sarene    Woolley       U                                   60        NaT       Assistant Manager                    IT     High Net Worth                  N                                                NaN       No     NaN
3998         3999       Patrizius        NaN    Male                                   11 1973-10-24                     NaN         Manufacturing  Affluent Customer                  N                             Â¡â¢Â£Â¢âÂ§Â¶â¢ÂªÂºââ       Yes    10.0
3999         4000           Kippy    Oldland    Male                                   76 1991-05-11    Software Engineer IV                   NaN  Affluent Customer                  N                                                0/0       No    11.0

[4000 rows x 13 columns]

In [4]:
address_df = pd.read_csv("custaddress.csv")

In [5]:
address_df

      customer_id                    address  postcode            state    country  property_valuation
0               1         060 Morning Avenue      2016  New South Wales  Australia                  10
1               2        6 Meadow Vale Court      2153  New South Wales  Australia                  10
2               4         0 Holy Cross Court      4211              QLD  Australia                   9
3               5        17979 Del Mar Point      2448  New South Wales  Australia                   4
4               6           9 Oakridge Court      3216              VIC  Australia                   9
...           ...                        ...       ...              ...        ...                 ...
3994         3999            1482 Hauk Trail      3064              VIC  Australia                   3
3995         4000  57042 Village Green Point      4511              QLD  Australia                   6
3996         4001     87 Crescent Oaks Alley      2756              NSW  Australia                  10
3997         4002           8194 Lien Street      4032              QLD  Australia                   7
3998         4003            320 Acker Drive      2251              NSW  Australia                   7

[3999 rows x 6 columns]

In [6]:
df = pd.merge(left=demo_df, right=address_df, how='inner', on="customer_id")

In [7]:
df

      customer_id      first_name  last_name  gender  past_3_years_bike_related_purchases        DOB               job_title job_industry_category     wealth_segment deceased_indicator                                            default owns_car  tenure                    address  postcode            state    country  property_valuation
0               1         Laraine  Medendorp       F                                   93 1953-12-10     Executive Secretary                Health      Mass Customer                  N                                                 "'      Yes    11.0         060 Morning Avenue      2016  New South Wales  Australia                  10
1               2             Eli    Bockman    Male                                   81 1980-12-16  Administrative Officer    Financial Services      Mass Customer                  N                       <script>alert('hi')</script>      Yes    16.0        6 Meadow Vale Court      2153  New South Wales  Australia                  10
2               4          Talbot        NaN    Male                                   33 1961-03-10                     NaN                    IT      Mass Customer                  N  () { _; } >_[$($())] { touch /tmp/blns.shellsh...       No     7.0         0 Holy Cross Court      4211              QLD  Australia                   9
3               5  Sheila-kathryn     Calton  Female                                   56 1977-05-13           Senior Editor                   NaN  Affluent Customer                  N                                                NIL      Yes     8.0        17979 Del Mar Point      2448  New South Wales  Australia                   4
4               6            Curr  Duckhouse    Male                                   35 1966-09-16                     NaN                Retail     High Net Worth                  N                                           ðµ ð ð ð      Yes    13.0           9 Oakridge Court      3216              VIC  Australia                   9
...           ...             ...        ...     ...                                  ...        ...                     ...                   ...                ...                ...                                                ...      ...     ...                        ...       ...              ...        ...                 ...
3991         3996         Rosalia   Halgarth  Female                                    8 1975-09-08   VP Product Management                Health      Mass Customer                  N                                          -1.00E+02       No    19.0         0 Transport Center      3977              VIC  Australia                   6
3992         3997          Blanch     Nisuis  Female                                   87 2001-07-13         Statistician II         Manufacturing     High Net Worth                  N                                           â¦testâ§      Yes     1.0        4 Dovetail Crossing      2350              NSW  Australia                   2
3993         3998          Sarene    Woolley       U                                   60        NaT       Assistant Manager                    IT     High Net Worth                  N                                                NaN       No     NaN       736 Roxbury Junction      2540              NSW  Australia                   6
3994         3999       Patrizius        NaN    Male                                   11 1973-10-24                     NaN         Manufacturing  Affluent Customer                  N                             Â¡â¢Â£Â¢âÂ§Â¶â¢ÂªÂºââ       Yes    10.0            1482 Hauk Trail      3064              VIC  Australia                   3
3995         4000           Kippy    Oldland    Male                                   76 1991-05-11    Software Engineer IV                   NaN  Affluent Customer                  N                                                0/0       No    11.0  57042 Village Green Point      4511              QLD  Australia                   6

[3996 rows x 18 columns]

In [8]:
#df.to_csv("demoadd.csv",index=False)

### Exploratory Data Analysis

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3996 entries, 0 to 3995
Data columns (total 18 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   customer_id                          3996 non-null   int64
 1   first_name                           3996 non-null   object
 2   last_name                            3871 non-null   object
 3   gender                               3996 non-null   object
 4   past_3_years_bike_related_purchases  3996 non-null   int64
 5   DOB                                  3909 non-null   datetime64[ns]
 6   job_title                            3492 non-null   object
 7   job_industry_category                3341 non-null   object
 8   wealth_segment                       3996 non-null   object
 9   deceased_indicator                   3996 non-null   object
 10  default                              3694 non-null   object
 11  owns_car                             3996 non-null   object
 12  tenure                               3909 non-null   float64
 13  address                              3996 non-null   object
 14  postcode                             3996 non-null   int64
 15  state                                3996 non-null   object
 16  country                              3996 non-null   object
 17  property_valuation                   3996 non-null   int64
dtypes: datetime64[ns](1), float64(1), int64(4), object(12)
memory usage: 593.2+ KB

In [10]:
df.describe()

       customer_id  past_3_years_bike_related_purchases       tenure     postcode  property_valuation
count  3996.000000                          3996.000000  3909.000000  3996.000000         3996.000000
mean   2002.487988                            48.880881    10.655922  2985.735485            7.514014
std    1153.710903                            28.724636     5.658533   844.945641            2.825426
min       1.000000                             0.000000     1.000000  2000.000000            1.000000
25%    1003.750000                            24.000000     6.000000  2200.000000            6.000000
50%    2002.500000                            48.000000    11.000000  2768.000000            8.000000
75%    3001.250000                            73.000000    15.000000  3750.000000           10.000000
max    4000.000000                            99.000000    22.000000  4883.000000           12.000000

In [11]:
df.columns

Index(['customer_id', 'first_name', 'last_name', 'gender', 'past_3_years_bike_related_purchases', 'DOB', 'job_title', 'job_industry_category', 'wealth_segment', 'deceased_indicator', 'default', 'owns_car', 'tenure', 'address', 'postcode', 'state', 'country', 'property_valuation'], dtype='object')

### Data Preprocessing

### Replacing values

All Australian states and territories have acronyms. All of the acronyms are pronounced letter by letter except for Victoria (Vic) and Tasmania (Tas).

In [12]:
df['state'].value_counts()

NSW                2052
VIC                 939
QLD                 837
New South Wales      86
Victoria             82
Name: state, dtype: int64

In [13]:
df['state'] = df['state'].replace('New South Wales','NSW')

In [14]:
df['state'] = df['state'].replace('Victoria','VIC')

In [15]:
df['state'].value_counts()

NSW    2138
VIC    1021
QLD     837
Name: state, dtype: int64

In [16]:
df['job_title'].value_counts()

Business Systems Development Analyst    45
Tax Accountant                          44
Social Worker                           44
Internal Auditor                        42
Legal Assistant                         41
                                        ..
Computer Systems Analyst III             4
Research Assistant III                   3
Health Coach III                         3
Health Coach I                           3
Developer I                              1
Name: job_title, Length: 195, dtype: int64

In [17]:
df['job_industry_category'].value_counts()

Manufacturing         799
Financial Services    773
Health                602
Retail                358
Property              266
IT                    222
Entertainment         136
Argiculture           113
Telecommunications     72
Name: job_industry_category, dtype: int64

In [18]:
#df.to_csv("demoadd.csv",index=False)

### Treat Duplicate Values

In [19]:
df.duplicated(keep='first').sum()

0